# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

arr = []
n = int(input("Введите кол-во чисел в списке "))
for i in range(n):
    arr.append(int(input("Введите число ")))
print(arr) 

arr2 = []
result = 0
i = 0
j = -1
while i < len(arr)/2:
    result = arr[i] * arr[j]
    arr2.append(result)
    i += 1
    j += -1
   
print(arr2)    